Revit 2027 API
IFCExtrusionData.ExtrusionBasis Property
 The basis used for the extrusion.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCExtrusionBasis ExtrusionBasis { get; set; }
Public Property ExtrusionBasis As IFCExtrusionBasis
	Get
	Set
public:
property IFCExtrusionBasis ExtrusionBasis {
	IFCExtrusionBasis get ();
	void set (IFCExtrusionBasis value);
}
member ExtrusionBasis : IFCExtrusionBasis with get, set
Property Value
IFCExtrusionBasis
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace